package com.company.JavaLesson6;

public class JavaLessonHW6_task1 {
    public static void main(String[] args) {
        //Создать массив целых чисел на 4 элемента. Вывести его значения на экран.
        int[] array = {4, 3, 2, 1};
        for (int i : array) {
            System.out.print(i + " ");
        }
    }
}
